# Setup

This is following [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html) for pandas 1.4.3

In [1]:
import numpy as np
import pandas as pd

# Object creation

In [2]:
# Series - pass a list to pd.Series
s1 = pd.Series([1, 2, 3, np.nan, 5])

In [3]:
s1

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
dtype: float64

In [4]:
# create an index to use in the dataframe
# default frequency is D (day), so creates a DatetimeIndex of 10 days
dates = pd.date_range('20220619', periods=10)
dates

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

just in case you are wondering, here's [all the "offset aliases"](https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries-offset-aliases) for Datetime

In [5]:
# Dataframe - pass a Numpy array
# create a 10 row, 4 col random number array, index by dates, give some column names
df = pd.DataFrame(np.random.randn(10, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2022-06-19  0.405896 -0.890516 -0.233123  0.218332
2022-06-20 -0.510613  0.987264 -0.201700  0.703191
2022-06-21  0.326200  1.276897 -0.033795 -0.559503
2022-06-22 -1.501268  1.053576  1.890587  1.540283
2022-06-23 -1.663098 -0.884329  0.331104  0.284198
2022-06-24  1.089926  0.972979 -0.966816 -1.303129
2022-06-25  0.757945 -0.662110 -1.080755  0.303775
2022-06-26 -0.004863  0.114707 -1.102682  0.824055
2022-06-27 -0.732961 -1.209034 -0.044629 -1.854467
2022-06-28 -0.607565 -0.020745  1.313907 -0.395297

In [6]:
# Create a dataframe by passing a dictionary of objects
# where each object can be converted into a series-like structure
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220619"),
        "C": pd.Series(1, index=list(range(6)), dtype="float32"),
        "D": np.array([3]*6, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train", "test", "train"]),
        "F": list("foofoo"),
        "G": "foo"
    }
)

df2

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

In [7]:
# the datatype of each of the columns would be different
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G            object
dtype: object

# Viewing Data

In [8]:
# top of the dataframe
df.head()

                   A         B         C         D
2022-06-19  0.405896 -0.890516 -0.233123  0.218332
2022-06-20 -0.510613  0.987264 -0.201700  0.703191
2022-06-21  0.326200  1.276897 -0.033795 -0.559503
2022-06-22 -1.501268  1.053576  1.890587  1.540283
2022-06-23 -1.663098 -0.884329  0.331104  0.284198

In [9]:
# bottom 3 records of the dataframe
df.tail(3)

                   A         B         C         D
2022-06-26 -0.004863  0.114707 -1.102682  0.824055
2022-06-27 -0.732961 -1.209034 -0.044629 -1.854467
2022-06-28 -0.607565 -0.020745  1.313907 -0.395297

In [10]:
# index of the df
df.index

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# columns of the df
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
# .to_numpy gives a NumPy representation of the dataframe
# this is expensive if all columns are of different data type
df.to_numpy()

array([[ 0.40589616, -0.89051588, -0.23312284,  0.21833234],
       [-0.51061264,  0.98726414, -0.20170045,  0.70319115],
       [ 0.32619989,  1.27689666, -0.0337951 , -0.55950304],
       [-1.50126756,  1.05357563,  1.89058745,  1.54028309],
       [-1.66309796, -0.88432939,  0.33110417,  0.28419771],
       [ 1.08992575,  0.97297904, -0.96681566, -1.30312903],
       [ 0.75794465, -0.66211042, -1.08075482,  0.3037753 ],
       [-0.00486277,  0.11470711, -1.10268163,  0.82405536],
       [-0.73296066, -1.20903367, -0.04462874, -1.85446666],
       [-0.60756501, -0.02074456,  1.3139065 , -0.39529712]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo']], dtype=object)

In [14]:
# quick summary stats
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.244040   0.073869  -0.012790  -0.023856
std     0.920437   0.948455   0.990258   1.020214
min    -1.663098  -1.209034  -1.102682  -1.854467
25%    -0.701612  -0.828775  -0.783392  -0.518452
50%    -0.257738   0.046981  -0.123165   0.251265
75%     0.385972   0.983693   0.239879   0.603337
max     1.089926   1.276897   1.890587   1.540283

1. **count** = Count number of non-NA/null observations
1. **max** = Maximum of the values in the object
1. **min** = Minimum of the values in the object
1. **mean** = Mean of the values
1. **std** = Standard deviation of the observations
1. **25%** = Default lower percentile
1. **50%** = 50 percentile - same as the median 
1. **75%** = Default upper percentile

In [15]:
# change the percentiles
df.describe(percentiles=[.1, .5, .9])

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.244040   0.073869  -0.012790  -0.023856
std     0.920437   0.948455   0.990258   1.020214
min    -1.663098  -1.209034  -1.102682  -1.854467
10%    -1.517451  -0.922368  -1.082948  -1.358263
50%    -0.257738   0.046981  -0.123165   0.251265
90%     0.791143   1.075908   1.371575   0.895678
max     1.089926   1.276897   1.890587   1.540283

In [16]:
# E, F, G in d2 are not numeric, so do not come up in describe()
df2.describe()

         A    C    D
count  6.0  6.0  6.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [17]:
# transpose the data
# turn rows to columns and vice versa
df.T

,2022-06-19,2022-06-20,2022-06-21,2022-06-22,2022-06-23,2022-06-24,2022-06-25,2022-06-26,2022-06-27,2022-06-28
A,0.405896,-0.510613,0.326200,-1.501268,-1.663098,1.089926,0.757945,-0.004863,-0.732961,-0.607565
B,-0.890516,0.987264,1.276897,1.053576,-0.884329,0.972979,-0.662110,0.114707,-1.209034,-0.020745
C,-0.233123,-0.201700,-0.033795,1.890587,0.331104,-0.966816,-1.080755,-1.102682,-0.044629,1.313907
D,0.218332,0.703191,-0.559503,1.540283,0.284198,-1.303129,0.303775,0.824055,-1.854467,-0.395297

### [Axis in pandas](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.set_axis.html?highlight=set_ax#pandas.DataFrame.set_axis)

```axis{0 or ‘index’, 1 or ‘columns’}```

Always remember that when you specify:
* ```axis=0``` or ```axis='index'``` you indicate that the operation should be along the _index_ (aka across the rows). More often than not indexes will go from top to bottom (vertically), but sometimes they may not (for e.g. if you use columns as index or when you have hierarchical or multi-index data).
* ```axis=1``` or ```axis='columns'``` indicates the operation is along the columns

When in doubt use the explicit version ```'index'``` or ```'columns'``` instead of ```0``` or ```1```

In [18]:
# sort along the axis - 1 = horizontal
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-06-19  0.218332 -0.233123 -0.890516  0.405896
2022-06-20  0.703191 -0.201700  0.987264 -0.510613
2022-06-21 -0.559503 -0.033795  1.276897  0.326200
2022-06-22  1.540283  1.890587  1.053576 -1.501268
2022-06-23  0.284198  0.331104 -0.884329 -1.663098
2022-06-24 -1.303129 -0.966816  0.972979  1.089926
2022-06-25  0.303775 -1.080755 -0.662110  0.757945
2022-06-26  0.824055 -1.102682  0.114707 -0.004863
2022-06-27 -1.854467 -0.044629 -1.209034 -0.732961
2022-06-28 -0.395297  1.313907 -0.020745 -0.607565

In [19]:
# sort along the axis - 0 = vertical
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2022-06-28 -0.607565 -0.020745  1.313907 -0.395297
2022-06-27 -0.732961 -1.209034 -0.044629 -1.854467
2022-06-26 -0.004863  0.114707 -1.102682  0.824055
2022-06-25  0.757945 -0.662110 -1.080755  0.303775
2022-06-24  1.089926  0.972979 -0.966816 -1.303129
2022-06-23 -1.663098 -0.884329  0.331104  0.284198
2022-06-22 -1.501268  1.053576  1.890587  1.540283
2022-06-21  0.326200  1.276897 -0.033795 -0.559503
2022-06-20 -0.510613  0.987264 -0.201700  0.703191
2022-06-19  0.405896 -0.890516 -0.233123  0.218332

In [20]:
# sort ascending by values in a column
df.sort_values(by="A")

                   A         B         C         D
2022-06-23 -1.663098 -0.884329  0.331104  0.284198
2022-06-22 -1.501268  1.053576  1.890587  1.540283
2022-06-27 -0.732961 -1.209034 -0.044629 -1.854467
2022-06-28 -0.607565 -0.020745  1.313907 -0.395297
2022-06-20 -0.510613  0.987264 -0.201700  0.703191
2022-06-26 -0.004863  0.114707 -1.102682  0.824055
2022-06-21  0.326200  1.276897 -0.033795 -0.559503
2022-06-19  0.405896 -0.890516 -0.233123  0.218332
2022-06-25  0.757945 -0.662110 -1.080755  0.303775
2022-06-24  1.089926  0.972979 -0.966816 -1.303129

In [21]:
# sort by non-numerical values
df2.sort_values(by="F", ascending=False)

     A          B    C  D      E  F    G
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo

In [22]:
# sort by two or more columns
df2.sort_values(by=["F", "E"])

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

# Selection

For production prefer the following instead of other data access methods (typical python methods like ["col"] or [a:b] slices etc.):

```.at, .iat, .loc and .iloc.```

## Getting

In [23]:
# selecting a single column returns a Series object
df["A"]

2022-06-19    0.405896
2022-06-20   -0.510613
2022-06-21    0.326200
2022-06-22   -1.501268
2022-06-23   -1.663098
2022-06-24    1.089926
2022-06-25    0.757945
2022-06-26   -0.004863
2022-06-27   -0.732961
2022-06-28   -0.607565
Freq: D, Name: A, dtype: float64

In [24]:
# selecting a slice
df[1:5]

                   A         B         C         D
2022-06-20 -0.510613  0.987264 -0.201700  0.703191
2022-06-21  0.326200  1.276897 -0.033795 -0.559503
2022-06-22 -1.501268  1.053576  1.890587  1.540283
2022-06-23 -1.663098 -0.884329  0.331104  0.284198

## Selection by label

In [25]:
# selecting based on a label
df.loc[dates[0]]

A    0.405896
B   -0.890516
C   -0.233123
D    0.218332
Name: 2022-06-19 00:00:00, dtype: float64

In [26]:
# select on a multi-axis by lable
# I honestly do not know what the comment above means...help!
df.loc[:, ["A", "B"]]

                   A         B
2022-06-19  0.405896 -0.890516
2022-06-20 -0.510613  0.987264
2022-06-21  0.326200  1.276897
2022-06-22 -1.501268  1.053576
2022-06-23 -1.663098 -0.884329
2022-06-24  1.089926  0.972979
2022-06-25  0.757945 -0.662110
2022-06-26 -0.004863  0.114707
2022-06-27 -0.732961 -1.209034
2022-06-28 -0.607565 -0.020745

In [27]:
# specific index value results in reduction of dimensions
res = df.loc["2022-06-20"]
print(res)
print("res.shape = ", res.shape, " vs. df.shape = ", df.shape)

A   -0.510613
B    0.987264
C   -0.201700
D    0.703191
Name: 2022-06-20 00:00:00, dtype: float64
res.shape =  (4,)  vs. df.shape =  (10, 4)

In [28]:
# get to a specific scalar:
#
# method one
df.loc[dates[0], "A"]

0.4058961606760863

In [29]:
#
# method two (slightly faster than method one)
df.at[dates[0], "A"]

0.4058961606760863

## Selection by position

In [30]:
df.iloc[2]

A    0.326200
B    1.276897
C   -0.033795
D   -0.559503
Name: 2022-06-21 00:00:00, dtype: float64

In [31]:
# slices - similar to NumPy / Python - [row:slice, col:slice]
df.iloc[1:5, 0:2]

                   A         B
2022-06-20 -0.510613  0.987264
2022-06-21  0.326200  1.276897
2022-06-22 -1.501268  1.053576
2022-06-23 -1.663098 -0.884329

In [32]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
df.iloc[[0, 1, 2, 6], [0, 2]]

                   A         C
2022-06-19  0.405896 -0.233123
2022-06-20 -0.510613 -0.201700
2022-06-21  0.326200 -0.033795
2022-06-25  0.757945 -1.080755

In [33]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
# change the order of columns, repeact a column
df.iloc[[0, 1, 2, 6], [2, 1, 0, 2]]

                   C         B         A         C
2022-06-19 -0.233123 -0.890516  0.405896 -0.233123
2022-06-20 -0.201700  0.987264 -0.510613 -0.201700
2022-06-21 -0.033795  1.276897  0.326200 -0.033795
2022-06-25 -1.080755 -0.662110  0.757945 -1.080755

In [34]:
# slice rows explicitly, keep all columns
df.iloc[[1, 2], :]

                   A         B         C         D
2022-06-20 -0.510613  0.987264 -0.201700  0.703191
2022-06-21  0.326200  1.276897 -0.033795 -0.559503

In [35]:
# slice columns, keep all rows
df.iloc[:, [2, 3]]

                   C         D
2022-06-19 -0.233123  0.218332
2022-06-20 -0.201700  0.703191
2022-06-21 -0.033795 -0.559503
2022-06-22  1.890587  1.540283
2022-06-23  0.331104  0.284198
2022-06-24 -0.966816 -1.303129
2022-06-25 -1.080755  0.303775
2022-06-26 -1.102682  0.824055
2022-06-27 -0.044629 -1.854467
2022-06-28  1.313907 -0.395297

In [36]:
# everything, because you can
df.iloc[:, :]

                   A         B         C         D
2022-06-19  0.405896 -0.890516 -0.233123  0.218332
2022-06-20 -0.510613  0.987264 -0.201700  0.703191
2022-06-21  0.326200  1.276897 -0.033795 -0.559503
2022-06-22 -1.501268  1.053576  1.890587  1.540283
2022-06-23 -1.663098 -0.884329  0.331104  0.284198
2022-06-24  1.089926  0.972979 -0.966816 -1.303129
2022-06-25  0.757945 -0.662110 -1.080755  0.303775
2022-06-26 -0.004863  0.114707 -1.102682  0.824055
2022-06-27 -0.732961 -1.209034 -0.044629 -1.854467
2022-06-28 -0.607565 -0.020745  1.313907 -0.395297

In [37]:
# get to a scalar (2 methods, just like before)
#
# method one: use iloc
df.iloc[1, 2]

-0.20170044604726364

In [38]:
#
# method two: use iat
df.iat[1, 2]

-0.20170044604726364

## Boolean Indexing

In [39]:
# use a value found in a single col to get data
df[df["A"] > 0]

                   A         B         C         D
2022-06-19  0.405896 -0.890516 -0.233123  0.218332
2022-06-21  0.326200  1.276897 -0.033795 -0.559503
2022-06-24  1.089926  0.972979 -0.966816 -1.303129
2022-06-25  0.757945 -0.662110 -1.080755  0.303775

In [40]:
# boolean across the entire DF - vals that don't match go NaN
df[df > 0]

                   A         B         C         D
2022-06-19  0.405896       NaN       NaN  0.218332
2022-06-20       NaN  0.987264       NaN  0.703191
2022-06-21  0.326200  1.276897       NaN       NaN
2022-06-22       NaN  1.053576  1.890587  1.540283
2022-06-23       NaN       NaN  0.331104  0.284198
2022-06-24  1.089926  0.972979       NaN       NaN
2022-06-25  0.757945       NaN       NaN  0.303775
2022-06-26       NaN  0.114707       NaN  0.824055
2022-06-27       NaN       NaN       NaN       NaN
2022-06-28       NaN       NaN  1.313907       NaN

In [41]:
# add another column
df11 = df.copy()
df11["E"] = ["one", "two", "three", "four",
             "two", "five", "one", "two", "three", "four"]
df11

                   A         B         C         D      E
2022-06-19  0.405896 -0.890516 -0.233123  0.218332    one
2022-06-20 -0.510613  0.987264 -0.201700  0.703191    two
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  three
2022-06-22 -1.501268  1.053576  1.890587  1.540283   four
2022-06-23 -1.663098 -0.884329  0.331104  0.284198    two
2022-06-24  1.089926  0.972979 -0.966816 -1.303129   five
2022-06-25  0.757945 -0.662110 -1.080755  0.303775    one
2022-06-26 -0.004863  0.114707 -1.102682  0.824055    two
2022-06-27 -0.732961 -1.209034 -0.044629 -1.854467  three
2022-06-28 -0.607565 -0.020745  1.313907 -0.395297   four

In [42]:
# the isin() query - basically the in clause
df11[df11["E"].isin(["two", "five"])]

                   A         B         C         D     E
2022-06-20 -0.510613  0.987264 -0.201700  0.703191   two
2022-06-23 -1.663098 -0.884329  0.331104  0.284198   two
2022-06-24  1.089926  0.972979 -0.966816 -1.303129  five
2022-06-26 -0.004863  0.114707 -1.102682  0.824055   two

## Setting values

In [43]:
# matching indexes auto-aligns values
s1 = pd.Series(range(11, 21), index=pd.date_range('20220619', periods=10))
s1

2022-06-19    11
2022-06-20    12
2022-06-21    13
2022-06-22    14
2022-06-23    15
2022-06-24    16
2022-06-25    17
2022-06-26    18
2022-06-27    19
2022-06-28    20
Freq: D, dtype: int64

In [44]:
df["F"] = s1
df

                   A         B         C         D   F
2022-06-19  0.405896 -0.890516 -0.233123  0.218332  11
2022-06-20 -0.510613  0.987264 -0.201700  0.703191  12
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14
2022-06-23 -1.663098 -0.884329  0.331104  0.284198  15
2022-06-24  1.089926  0.972979 -0.966816 -1.303129  16
2022-06-25  0.757945 -0.662110 -1.080755  0.303775  17
2022-06-26 -0.004863  0.114707 -1.102682  0.824055  18
2022-06-27 -0.732961 -1.209034 -0.044629 -1.854467  19
2022-06-28 -0.607565 -0.020745  1.313907 -0.395297  20

In [45]:
# setting values by label and position
# first let's make a quick copy
df12 = df.copy()
df12

                   A         B         C         D   F
2022-06-19  0.405896 -0.890516 -0.233123  0.218332  11
2022-06-20 -0.510613  0.987264 -0.201700  0.703191  12
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14
2022-06-23 -1.663098 -0.884329  0.331104  0.284198  15
2022-06-24  1.089926  0.972979 -0.966816 -1.303129  16
2022-06-25  0.757945 -0.662110 -1.080755  0.303775  17
2022-06-26 -0.004863  0.114707 -1.102682  0.824055  18
2022-06-27 -0.732961 -1.209034 -0.044629 -1.854467  19
2022-06-28 -0.607565 -0.020745  1.313907 -0.395297  20

In [46]:
# set by label
df12.at[dates[0], "A"] = 0
# set by position
df12.iat[0, 1] = 0
df12

                   A         B         C         D   F
2022-06-19  0.000000  0.000000 -0.233123  0.218332  11
2022-06-20 -0.510613  0.987264 -0.201700  0.703191  12
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14
2022-06-23 -1.663098 -0.884329  0.331104  0.284198  15
2022-06-24  1.089926  0.972979 -0.966816 -1.303129  16
2022-06-25  0.757945 -0.662110 -1.080755  0.303775  17
2022-06-26 -0.004863  0.114707 -1.102682  0.824055  18
2022-06-27 -0.732961 -1.209034 -0.044629 -1.854467  19
2022-06-28 -0.607565 -0.020745  1.313907 -0.395297  20

In [47]:
# kinda bigger replacement
df12.loc[:, "D"] = np.array([5]*len(df))
df12

                   A         B         C  D   F
2022-06-19  0.000000  0.000000 -0.233123  5  11
2022-06-20 -0.510613  0.987264 -0.201700  5  12
2022-06-21  0.326200  1.276897 -0.033795  5  13
2022-06-22 -1.501268  1.053576  1.890587  5  14
2022-06-23 -1.663098 -0.884329  0.331104  5  15
2022-06-24  1.089926  0.972979 -0.966816  5  16
2022-06-25  0.757945 -0.662110 -1.080755  5  17
2022-06-26 -0.004863  0.114707 -1.102682  5  18
2022-06-27 -0.732961 -1.209034 -0.044629  5  19
2022-06-28 -0.607565 -0.020745  1.313907  5  20

In [48]:
# setting values using a boolean selection (aka where clause)
df12[df12 > 0] = -df12
df12

                   A         B         C  D   F
2022-06-19  0.000000  0.000000 -0.233123 -5 -11
2022-06-20 -0.510613 -0.987264 -0.201700 -5 -12
2022-06-21 -0.326200 -1.276897 -0.033795 -5 -13
2022-06-22 -1.501268 -1.053576 -1.890587 -5 -14
2022-06-23 -1.663098 -0.884329 -0.331104 -5 -15
2022-06-24 -1.089926 -0.972979 -0.966816 -5 -16
2022-06-25 -0.757945 -0.662110 -1.080755 -5 -17
2022-06-26 -0.004863 -0.114707 -1.102682 -5 -18
2022-06-27 -0.732961 -1.209034 -0.044629 -5 -19
2022-06-28 -0.607565 -0.020745 -1.313907 -5 -20

# Missing Data

### _reindex_
change/add/delete index on a specified axis, returns a new dataframe

In [49]:
df13 = df.reindex(index=dates[0:4], columns=list(df.columns)+["G"])
df13

                   A         B         C         D   F   G
2022-06-19  0.405896 -0.890516 -0.233123  0.218332  11 NaN
2022-06-20 -0.510613  0.987264 -0.201700  0.703191  12 NaN
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13 NaN
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14 NaN

### handling missing data
1. _```np.nan```_
1. _```pandas.isna()```_
1. ```df.dropna()```
1. ```df.fillna()```

In [50]:
# missing data in pandas is np.nan
df13.iat[1, 0] = np.nan
df13.iloc[1:, 5] = np.random.randint(1)
df13

                   A         B         C         D   F    G
2022-06-19  0.405896 -0.890516 -0.233123  0.218332  11  NaN
2022-06-20       NaN  0.987264 -0.201700  0.703191  12  0.0
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13  0.0
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14  0.0

In [51]:
# get a boolean mask where values are NaN
df131 = pd.isna(df13)
df131

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [52]:
# or just
pd.isna(df13)

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [53]:
# the original is still there
df13

                   A         B         C         D   F    G
2022-06-19  0.405896 -0.890516 -0.233123  0.218332  11  NaN
2022-06-20       NaN  0.987264 -0.201700  0.703191  12  0.0
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13  0.0
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14  0.0

In [54]:
# we are going to drop / replace values now, let's make a couple of copies of the dataframe
df132 = df13.copy()
df132

                   A         B         C         D   F    G
2022-06-19  0.405896 -0.890516 -0.233123  0.218332  11  NaN
2022-06-20       NaN  0.987264 -0.201700  0.703191  12  0.0
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13  0.0
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14  0.0

In [55]:
# drop rows/columns that have missing data
# by default it returns a new dataframe, you may want to specify inplace=True for modifying current dataframe:
df_no_na = df132.dropna(how="any")
# how=‘any’ : If any NA values are present, drop that row or column.
# how=‘all’ : If all values are NA, drop that row or column.

In [56]:
# all rows/cols with missing data stripped
df_no_na

                   A         B         C         D   F    G
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13  0.0
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14  0.0

In [57]:
# original still intact
df132

                   A         B         C         D   F    G
2022-06-19  0.405896 -0.890516 -0.233123  0.218332  11  NaN
2022-06-20       NaN  0.987264 -0.201700  0.703191  12  0.0
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13  0.0
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14  0.0

In [58]:
# drop missing data from original
df132.dropna(how="any", inplace=True)
df132

                   A         B         C         D   F    G
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13  0.0
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14  0.0

In [59]:
# fill missing data
df133 = df13.copy()
df133.fillna(np.pi*1000)

                      A         B         C         D   F            G
2022-06-19     0.405896 -0.890516 -0.233123  0.218332  11  3141.592654
2022-06-20  3141.592654  0.987264 -0.201700  0.703191  12     0.000000
2022-06-21     0.326200  1.276897 -0.033795 -0.559503  13     0.000000
2022-06-22    -1.501268  1.053576  1.890587  1.540283  14     0.000000

# Align and Join

There needs to be a bigger notebook for this topic.
You need to know there's "joins" in Pandas just like in the SQL world, 
like join and left join and right join and inner and outer and all that...
Here we'll explore these in the context of the align function - 'aligning' the indexes of two dataframes.
Later we'll see these again in the context of _merging_ two data frames.

## Create two datasets with _mismatched_ indexes

In [60]:
# date range indexes
idx1 = pd.date_range('2022-01-01',periods = 10)
# 2022-01-01', '2022-01-02' don't exist in idx2
# '2022-01-11', '2022-01-12' don't exist in idx1
idx2 = pd.date_range('2022-01-03',periods = 10)

In [61]:
# dataframes from indexes
d1 = pd.DataFrame(index = idx1, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

d2 = pd.DataFrame(index = idx2, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

## Quick Aside: Rendering two dataframes side-by-side

The trick of rendering 2 dataframes side-by-side was from [this](https://stackoverflow.com/questions/38783027/jupyter-notebook-display-two-pandas-tables-side-by-side) stackoverflow question.

In [62]:
# we gon need to display both data frames side by side, so...
from IPython.display import display_html 
def render_df_side_by_side(a, b, a_title = "", b_title = ""):
    a_styler = a.style.set_table_attributes("style='display:inline'").set_caption(a_title)
    b_styler = b.style.set_table_attributes("style='display:inline'").set_caption(b_title)
    display_html(a_styler._repr_html_()+b_styler._repr_html_(), raw=True)

In [63]:
render_df_side_by_side(d1,d2)

,A,B
2022-01-01 00:00:00,0.064299,4
2022-01-02 00:00:00,0.465212,8
2022-01-03 00:00:00,0.072938,21
2022-01-04 00:00:00,0.946406,8
2022-01-05 00:00:00,0.212040,15
2022-01-06 00:00:00,0.756587,15
2022-01-07 00:00:00,0.633421,15
2022-01-08 00:00:00,0.111405,11
2022-01-09 00:00:00,0.588798,6
2022-01-10 00:00:00,0.719556,11
,A,B
2022-01-03 00:00:00,0.041787,16
2022-01-04 00:00:00,0.449329,13
2022-01-05 00:00:00,0.028673,4
2022-01-06 00:00:00,0.178781,8
2022-01-07 00:00:00,0.002739,21
2022-01-08 00:00:00,0.579807,6
2022-01-09 00:00:00,0.281419,13
2022-01-10 00:00:00,0.711464,20
2022-01-11 00:00:00,0.918642,9
2022-01-12 00:00:00,0.726316,16

Table rendering/styling options is [a bigger discussion](https://pandas.pydata.org/pandas-docs/stable/user_guide/style.html#) to be tackled later.

## .add, .sub, .mul, .div etc.

flexible wrappers (```add, sub, mul, div, mod, pow```) to arithmetic operators: ```+, -, *, /, //, %, **```

In [64]:
# the +, -, *, /, //, %, ** operations align indexes to create a UNION of indexes
d3 = d1+d2
d4 = d1.sub(d2) #equivalent to d1-d2
d5 = d1*d2
d6 = d1.div(d2)

In [65]:
# indexs not present in the other dataframe get a NaN
d3.style.highlight_null(null_color='red')

In [66]:
# sub
d4.style.highlight_null(null_color='red')

In [67]:
# mul
d5.style.highlight_null(null_color='red')

In [68]:
# div
d6.style.highlight_null(null_color='red')

### removing the NaN values from the resultant dataframe

In [69]:
# the + operation is UNION of indexes
d31 = d1+d2
# indexs not present in the other dataframe get a NaN
# do you can obvs remove nan values like before
d3.dropna().style.highlight_null(null_color='red')

## df.align()

Pandas [align](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.align.html) works to join the dataframes in interesting ways.

In [70]:
# align returns two dataframes - left and right as a result of a join
# default join is outer - the union of indices will be used as index for left and right
left, right = d1.align(d2, join='outer')
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.064299,4.000000
2022-01-02 00:00:00,0.465212,8.000000
2022-01-03 00:00:00,0.072938,21.000000
2022-01-04 00:00:00,0.946406,8.000000
2022-01-05 00:00:00,0.212040,15.000000
2022-01-06 00:00:00,0.756587,15.000000
2022-01-07 00:00:00,0.633421,15.000000
2022-01-08 00:00:00,0.111405,11.000000
2022-01-09 00:00:00,0.588798,6.000000
2022-01-10 00:00:00,0.719556,11.000000
2022-01-11 00:00:00,nan,nan
2022-01-12 00:00:00,nan,nan
,A,B
2022-01-01 00:00:00,nan,nan
2022-01-02 00:00:00,nan,nan
2022-01-03 00:00:00,0.041787,16.000000
2022-01-04 00:00:00,0.449329,13.000000
2022-01-05 00:00:00,0.028673,4.000000
2022-01-06 00:00:00,0.178781,8.000000
2022-01-07 00:00:00,0.002739,21.000000
2022-01-08 00:00:00,0.579807,6.000000
2022-01-09 00:00:00,0.281419,13.000000
2022-01-10 00:00:00,0.711464,20.000000
2022-01-11 00:00:00,0.918642,9.000000
2022-01-12 00:00:00,0.726316,16.000000

In [71]:
# inner join
left, right = d1.align(d2, join='inner')
render_df_side_by_side(d1,d2)

,A,B
2022-01-01 00:00:00,0.064299,4
2022-01-02 00:00:00,0.465212,8
2022-01-03 00:00:00,0.072938,21
2022-01-04 00:00:00,0.946406,8
2022-01-05 00:00:00,0.212040,15
2022-01-06 00:00:00,0.756587,15
2022-01-07 00:00:00,0.633421,15
2022-01-08 00:00:00,0.111405,11
2022-01-09 00:00:00,0.588798,6
2022-01-10 00:00:00,0.719556,11
,A,B
2022-01-03 00:00:00,0.041787,16
2022-01-04 00:00:00,0.449329,13
2022-01-05 00:00:00,0.028673,4
2022-01-06 00:00:00,0.178781,8
2022-01-07 00:00:00,0.002739,21
2022-01-08 00:00:00,0.579807,6
2022-01-09 00:00:00,0.281419,13
2022-01-10 00:00:00,0.711464,20
2022-01-11 00:00:00,0.918642,9
2022-01-12 00:00:00,0.726316,16

In [72]:
# we can fill the NaNs with a certain value if needed
# let's fill with -100 so we can see it clearly
left, right = d1.align(d2, join='outer', fill_value = -100) 
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.064299,4
2022-01-02 00:00:00,0.465212,8
2022-01-03 00:00:00,0.072938,21
2022-01-04 00:00:00,0.946406,8
2022-01-05 00:00:00,0.212040,15
2022-01-06 00:00:00,0.756587,15
2022-01-07 00:00:00,0.633421,15
2022-01-08 00:00:00,0.111405,11
2022-01-09 00:00:00,0.588798,6
2022-01-10 00:00:00,0.719556,11
2022-01-11 00:00:00,-100.000000,-100
2022-01-12 00:00:00,-100.000000,-100
,A,B
2022-01-01 00:00:00,-100.000000,-100
2022-01-02 00:00:00,-100.000000,-100
2022-01-03 00:00:00,0.041787,16
2022-01-04 00:00:00,0.449329,13
2022-01-05 00:00:00,0.028673,4
2022-01-06 00:00:00,0.178781,8
2022-01-07 00:00:00,0.002739,21
2022-01-08 00:00:00,0.579807,6
2022-01-09 00:00:00,0.281419,13
2022-01-10 00:00:00,0.711464,20
2022-01-11 00:00:00,0.918642,9
2022-01-12 00:00:00,0.726316,16

In [73]:
# left join: left index is added to right, but not the other way
left, right = d1.align(d2, join='left') 
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.064299,4
2022-01-02 00:00:00,0.465212,8
2022-01-03 00:00:00,0.072938,21
2022-01-04 00:00:00,0.946406,8
2022-01-05 00:00:00,0.212040,15
2022-01-06 00:00:00,0.756587,15
2022-01-07 00:00:00,0.633421,15
2022-01-08 00:00:00,0.111405,11
2022-01-09 00:00:00,0.588798,6
2022-01-10 00:00:00,0.719556,11
,A,B
2022-01-01 00:00:00,nan,nan
2022-01-02 00:00:00,nan,nan
2022-01-03 00:00:00,0.041787,16.000000
2022-01-04 00:00:00,0.449329,13.000000
2022-01-05 00:00:00,0.028673,4.000000
2022-01-06 00:00:00,0.178781,8.000000
2022-01-07 00:00:00,0.002739,21.000000
2022-01-08 00:00:00,0.579807,6.000000
2022-01-09 00:00:00,0.281419,13.000000
2022-01-10 00:00:00,0.711464,20.000000

In [74]:
# right join: right index is added to left, but not the other way
left, right = d1.align(d2, join='right') 
render_df_side_by_side(left, right)

,A,B
2022-01-03 00:00:00,0.072938,21.000000
2022-01-04 00:00:00,0.946406,8.000000
2022-01-05 00:00:00,0.212040,15.000000
2022-01-06 00:00:00,0.756587,15.000000
2022-01-07 00:00:00,0.633421,15.000000
2022-01-08 00:00:00,0.111405,11.000000
2022-01-09 00:00:00,0.588798,6.000000
2022-01-10 00:00:00,0.719556,11.000000
2022-01-11 00:00:00,nan,nan
2022-01-12 00:00:00,nan,nan
,A,B
2022-01-03 00:00:00,0.041787,16
2022-01-04 00:00:00,0.449329,13
2022-01-05 00:00:00,0.028673,4
2022-01-06 00:00:00,0.178781,8
2022-01-07 00:00:00,0.002739,21
2022-01-08 00:00:00,0.579807,6
2022-01-09 00:00:00,0.281419,13
2022-01-10 00:00:00,0.711464,20
2022-01-11 00:00:00,0.918642,9
2022-01-12 00:00:00,0.726316,16

There's more to explore in align, and it can get confusing, so beginners be careful, take time and try to work out the result before you execute to build intuition.

# Operations on data

## Stats

Operations in general *exclude* missing data

In [75]:
# arithmetic mean, for each column (axis = 0)
df.mean()

A    -0.244040
B     0.073869
C    -0.012790
D    -0.023856
F    15.500000
dtype: float64

In [76]:
# mean across a row (axis = 1)
df.mean(1)

2022-06-19    2.100118
2022-06-20    2.595628
2022-06-21    2.801960
2022-06-22    3.396636
2022-06-23    2.613575
2022-06-24    3.158592
2022-06-25    3.263771
2022-06-26    3.566244
2022-06-27    3.031782
2022-06-28    4.058060
Freq: D, dtype: float64

## Apply

In [77]:
# apply custom lambdas
df.apply(lambda x: x.max()-x.min())

A    2.753024
B    2.485930
C    2.993269
D    3.394750
F    9.000000
dtype: float64

In [78]:
df

                   A         B         C         D   F
2022-06-19  0.405896 -0.890516 -0.233123  0.218332  11
2022-06-20 -0.510613  0.987264 -0.201700  0.703191  12
2022-06-21  0.326200  1.276897 -0.033795 -0.559503  13
2022-06-22 -1.501268  1.053576  1.890587  1.540283  14
2022-06-23 -1.663098 -0.884329  0.331104  0.284198  15
2022-06-24  1.089926  0.972979 -0.966816 -1.303129  16
2022-06-25  0.757945 -0.662110 -1.080755  0.303775  17
2022-06-26 -0.004863  0.114707 -1.102682  0.824055  18
2022-06-27 -0.732961 -1.209034 -0.044629 -1.854467  19
2022-06-28 -0.607565 -0.020745  1.313907 -0.395297  20

In [79]:
# each subsequent value is a sum of all values before it in the respective column
cumsum_df = df.apply(np.cumsum)
render_df_side_by_side(df, cumsum_df, "OG Dataframe", "Cumulative Sum")

,A,B,C,D,F
2022-06-19 00:00:00,0.405896,-0.890516,-0.233123,0.218332,11
2022-06-20 00:00:00,-0.510613,0.987264,-0.201700,0.703191,12
2022-06-21 00:00:00,0.326200,1.276897,-0.033795,-0.559503,13
2022-06-22 00:00:00,-1.501268,1.053576,1.890587,1.540283,14
2022-06-23 00:00:00,-1.663098,-0.884329,0.331104,0.284198,15
2022-06-24 00:00:00,1.089926,0.972979,-0.966816,-1.303129,16
2022-06-25 00:00:00,0.757945,-0.662110,-1.080755,0.303775,17
2022-06-26 00:00:00,-0.004863,0.114707,-1.102682,0.824055,18
2022-06-27 00:00:00,-0.732961,-1.209034,-0.044629,-1.854467,19
2022-06-28 00:00:00,-0.607565,-0.020745,1.313907,-0.395297,20
,A,B,C,D,F
2022-06-19 00:00:00,0.405896,-0.890516,-0.233123,0.218332,11
2022-06-20 00:00:00,-0.104716,0.096748,-0.434823,0.921523,23
2022-06-21 00:00:00,0.221483,1.373645,-0.468618,0.362020,36
2022-06-22 00:00:00,-1.279784,2.427221,1.421969,1.902304,50
2022-06-23 00:00:00,-2.942882,1.542891,1.753073,2.186501,65
2022-06-24 00:00:00,-1.852956,2.515870,0.786258,0.883372,81
2022-06-25 00:00:00,-1.095012,1.853760,-0.294497,1.187148,98
2022-06-26 00:00:00,-1.099874,1.968467,-1.397179,2.011203,116
2022-06-27 00:00:00,-1.832835,0.759433,-1.441808,0.156736,135
2022-06-28 00:00:00,-2.440400,0.738689,-0.127901,-0.238561,155

## Histogramming

Frequencies, 'nuff said

```value_counts()```

In [80]:
series1 = pd.Series(np.random.randint(0,5, size = 25))
series1.value_counts()

0    9
1    5
2    4
4    4
3    3
dtype: int64

## String Methods

In [81]:
# build a series
some_string = "SERIes and Index are EqUIppeD WITh A seT Of stRINg PROCESSING METHoDs In tHe ```sTR``` attrIBute THAT MakE IT eASy To oPerATE ON EACh ELEmeNt OF The aRrAY. NOtE thAt PAtTERN-maTching in ```sTR``` gENeralLY UsES reGUlAr eXpreSsiONs bY DEfault (aND In Some cases AlwayS uSEs tHeM)."
str_series = pd.Series(some_string.split()) # split splits on whitespace by default

In [82]:
# manipulating the case - lower, upper etc.
# also the length of each string, split, replace, yada yada...
# very important when cleaning data (column names may have stupid whitespace, bad case, spacing etc.)
low = str_series.str.lower()
up = str_series.str.upper()

low_up_df = pd.DataFrame(
    {
        'og': str_series,
        'length': str_series.str.len(),
        'low': low,
        'up': up,
        'split_low_on_i': low.str.split('i', expand = False), # expand = True will break this usecase, try elsewhere
        'replace_a_with_star_in_low': low.str.replace('a','*', case=False, regex=True) # yeah, you can mess with regular expns
    })

low_up_df.tail(10)

,og,length,low,up,split_low_on_i,replace_a_with_star_in_low
36,eXpreSsiONs,11,expressions,EXPRESSIONS,"[express, ons]",expressions
37,bY,2,by,BY,[by],by
38,DEfault,7,default,DEFAULT,[default],def*ult
39,(aND,4,(and,(AND,[(and],(*nd
40,In,2,in,IN,"[, n]",in
41,Some,4,some,SOME,[some],some
42,cases,5,cases,CASES,[cases],c*ses
43,AlwayS,6,always,ALWAYS,[always],*lw*ys
44,uSEs,4,uses,USES,[uses],uses
45,tHeM).,6,them).,THEM).,[them).],them).

See [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-string-methods) for more string operations.

# Merge

Combine series and dataframes, use set logic for indexes and relational algebra for joins/merges

## Concat

Chill, we've done this before. The same join = inner/outer/left/right drill.

In [83]:
# let's make some more dataframes
concatDF = pd.DataFrame(np.random.randn(10,4)) # 10 rows and 4 columns of random numbers
pieces = [concatDF[:3], concatDF[3:7], concatDF[7:]]
reconstructedDF = pd.concat(pieces)
display('broken DFs: ',pieces)
render_df_side_by_side(concatDF, reconstructedDF, "OG", "Concatenated")

'broken DFs: '

[          0         1         2         3
 0 -0.444867 -0.113722  1.204040  0.192258
 1 -0.739618 -1.506005 -1.485069 -0.921034
 2 -1.377023 -1.080884  0.924965  1.035190,
           0         1         2         3
 3 -0.357090  1.495616 -1.501716 -1.603082
 4  1.416170 -0.388192 -0.570299 -0.800701
 5 -1.032919  0.974000 -0.552961 -0.200435
 6 -0.581656  0.470206  0.165343 -1.088236,
           0         1         2         3
 7  0.555850  0.867754  1.289255  0.023449
 8  1.130814 -0.985317  0.968113 -0.787695
 9 -0.693033 -1.028052 -0.106119 -1.171483]

,0,1,2,3
0,-0.444867,-0.113722,1.204040,0.192258
1,-0.739618,-1.506005,-1.485069,-0.921034
2,-1.377023,-1.080884,0.924965,1.035190
3,-0.357090,1.495616,-1.501716,-1.603082
4,1.416170,-0.388192,-0.570299,-0.800701
5,-1.032919,0.974000,-0.552961,-0.200435
6,-0.581656,0.470206,0.165343,-1.088236
7,0.555850,0.867754,1.289255,0.023449
8,1.130814,-0.985317,0.968113,-0.787695
9,-0.693033,-1.028052,-0.106119,-1.171483
,0,1,2,3
0,-0.444867,-0.113722,1.204040,0.192258
1,-0.739618,-1.506005,-1.485069,-0.921034
2,-1.377023,-1.080884,0.924965,1.035190
3,-0.357090,1.495616,-1.501716,-1.603082
4,1.416170,-0.388192,-0.570299,-0.800701
5,-1.032919,0.974000,-0.552961,-0.200435
6,-0.581656,0.470206,0.165343,-1.088236
7,0.555850,0.867754,1.289255,0.023449
8,1.130814,-0.985317,0.968113,-0.787695
9,-0.693033,-1.028052,-0.106119,-1.171483

_From the [page](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#concat)_:
Adding a column to a DataFrame is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the DataFrame constructor instead of building a DataFrame by iteratively appending records to it.

## Join
SQL style merges.

In [84]:
# two data frames
sl = pd.Series(np.random.randint(10, size=6))
sr = sl.shift(2).fillna(0).astype(int)
left = pd.DataFrame(
    {
        'key': list('ABCDEF'),
        'lval': sl
    }
)

right = pd.DataFrame(
    {
        'key': list('ABBCDE'),
        'rval': sr
    }
)

In [85]:
render_df_side_by_side(left, right, 'left', 'right')

,key,lval
0,A,4
1,B,5
2,C,7
3,D,0
4,E,3
5,F,5
,key,rval
0,A,0
1,B,0
2,B,4
3,C,5
4,D,7
5,E,0

In [86]:
result = pd.merge(left, right, on='key')
result

  key  lval  rval
0   A     4     0
1   B     5     0
2   B     5     4
3   C     7     5
4   D     0     7
5   E     3     0

# Grouping

"Group By" really means one or more of the following happening:
1. **Split**: data is broken into groups based on some criteria
2. **Apply**: a data operation is executed on each of those groups
3. **Combine**: the results are combined back into a data structure

In [87]:
grp_df = pd.DataFrame(
    {
        'colA': list('AABCAABDAA'),
        'colB': list('1234567890'),
        'colC': np.random.randn(10),
        'colD': np.random.randn(10)
    }
)
grp_df

  colA colB      colC      colD
0    A    1  0.212542  0.150769
1    A    2 -1.500768 -0.509841
2    B    3 -1.466514 -3.408480
3    C    4 -0.841961 -0.048857
4    A    5  0.402301 -0.431289
5    A    6  0.479236  1.020105
6    B    7 -0.615263 -1.426470
7    D    8 -0.002712 -1.316860
8    A    9 -1.725911  0.160209
9    A    0 -0.160896  0.282916

In [88]:
# a DataFrameGroupBy object object
grpby = grp_df.groupby('colA')

# list all the groups found
g = grpby.groups
g

{'A': [0, 1, 4, 5, 8, 9], 'B': [2, 6], 'C': [3], 'D': [7]}

In [89]:
# to create a dataframe from the group use something like
grpby.get_group('A')

  colA colB      colC      colD
0    A    1  0.212542  0.150769
1    A    2 -1.500768 -0.509841
4    A    5  0.402301 -0.431289
5    A    6  0.479236  1.020105
8    A    9 -1.725911  0.160209
9    A    0 -0.160896  0.282916

### Find all the groups

In [90]:
# but we may not know all the groups in the dataframe.
# so got to find a way to list all groups as dataframes.
# 
# some basic python helps create a list of groupby names
grpby_labels_list = [*g.keys()] # using the unpacking operator *
# alternatively
# grpby_labels_list = list(g.keys())
grpby_labels_list

['A', 'B', 'C', 'D']

In [91]:
# create a dict where the group label is the key and the group dataframe is the value
grps = {lbl: grpby.get_group(lbl) for lbl in grpby_labels_list}

# now use the dict to access individual dataframes created out of the groupby operation
grps['B']

# question: can we create a dataframe of dataframes?

  colA colB      colC     colD
2    B    3 -1.466514 -3.40848
6    B    7 -0.615263 -1.42647

In [92]:
# You can see the datatype of the value is a pandas dataframe
type(grps['A'])

pandas.core.frame.DataFrame

In [93]:
# make a function of it all...
def get_all_groups(df_grpby):
    return {lbl: df_grpby.get_group(lbl) for lbl in [*df_grpby.groups.keys()]}

In [94]:
grps = get_all_groups(grpby)
grps

{'A':   colA colB      colC      colD
 0    A    1  0.212542  0.150769
 1    A    2 -1.500768 -0.509841
 4    A    5  0.402301 -0.431289
 5    A    6  0.479236  1.020105
 8    A    9 -1.725911  0.160209
 9    A    0 -0.160896  0.282916,
 'B':   colA colB      colC     colD
 2    B    3 -1.466514 -3.40848
 6    B    7 -0.615263 -1.42647,
 'C':   colA colB      colC      colD
 3    C    4 -0.841961 -0.048857,
 'D':   colA colB      colC     colD
 7    D    8 -0.002712 -1.31686}

In [95]:
# get a sum of values from each group
grp_df.groupby('colA').sum()

          colC      colD
colA
A    -2.293496  0.672869
B    -2.081776 -4.834951
C    -0.841961 -0.048857
D    -0.002712 -1.316860

In [96]:
# let's add one more column to the dataframe
# we can try grouping on two columns
grp_df['colE'] = list('1231231231')
grp_df

  colA colB      colC      colD colE
0    A    1  0.212542  0.150769    1
1    A    2 -1.500768 -0.509841    2
2    B    3 -1.466514 -3.408480    3
3    C    4 -0.841961 -0.048857    1
4    A    5  0.402301 -0.431289    2
5    A    6  0.479236  1.020105    3
6    B    7 -0.615263 -1.426470    1
7    D    8 -0.002712 -1.316860    2
8    A    9 -1.725911  0.160209    3
9    A    0 -0.160896  0.282916    1

In [97]:
g2 = grp_df.groupby(['colA','colE'])
grps2 = get_all_groups(g2)
grps2

{('A',
  '1'):   colA colB      colC      colD colE
 0    A    1  0.212542  0.150769    1
 9    A    0 -0.160896  0.282916    1,
 ('A',
  '2'):   colA colB      colC      colD colE
 1    A    2 -1.500768 -0.509841    2
 4    A    5  0.402301 -0.431289    2,
 ('A',
  '3'):   colA colB      colC      colD colE
 5    A    6  0.479236  1.020105    3
 8    A    9 -1.725911  0.160209    3,
 ('B',
  '1'):   colA colB      colC     colD colE
 6    B    7 -0.615263 -1.42647    1,
 ('B',
  '3'):   colA colB      colC     colD colE
 2    B    3 -1.466514 -3.40848    3,
 ('C',
  '1'):   colA colB      colC      colD colE
 3    C    4 -0.841961 -0.048857    1,
 ('D',
  '2'):   colA colB      colC     colD colE
 7    D    8 -0.002712 -1.31686    2}

In [98]:
render_df_side_by_side(grps2[('A','1')], grps2[('A','2')], 'A,1', 'A,2')

,colA,colB,colC,colD,colE
0,A,1,0.212542,0.150769,1
9,A,0,-0.160896,0.282916,1
,colA,colB,colC,colD,colE
1,A,2,-1.500768,-0.509841,2
4,A,5,0.402301,-0.431289,2

# Reshaping

Stacking and Pivot Tables.
This really warrants more practice, at least go through [the page](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html#)

## Stacking

In [99]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
    )
)

If the syntax [*expression](https://docs.python.org/dev/reference/expressions.html#calls) appears in the function call, expression must evaluate to an iterable. Elements from these iterables are treated as if they were additional positional arguments.

...although the *expression syntax may appear after explicit keyword arguments, it is processed before the keyword arguments (and any **expression arguments)

In [100]:
# starred expressions...
def f(a,b):
    print(a, ' ', b)
    
f (b=1, *(2,)) # works, the tuple (iterable) is expanded, 2 is assigned to a, then b fills the next argument slot
# f (a=1, *(2,)) # FAILS, multiple values for argument 'a'

2   1

In [101]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [102]:
stack_idx = pd.MultiIndex.from_tuples(tuples, names = ['first', 'second'])

In [103]:
stack_df = pd.DataFrame(np.random.randn(8,2), index = stack_idx, columns = ['a','b'])
stack_df

                     a         b
first second
bar   one     2.238318 -2.343009
      two    -0.341262  0.096108
baz   one    -0.298054 -0.363310
      two    -0.037365  0.712647
foo   one    -1.764934  0.332688
      two    -0.789687 -0.191329
qux   one    -1.185812 -0.882751
      two     1.317084  0.863988

In [104]:
# stack really just combines the columns
stacked = stack_df.stack()
stacked

first  second
bar    one     a    2.238318
               b   -2.343009
       two     a   -0.341262
               b    0.096108
baz    one     a   -0.298054
               b   -0.363310
       two     a   -0.037365
               b    0.712647
foo    one     a   -1.764934
               b    0.332688
       two     a   -0.789687
               b   -0.191329
qux    one     a   -1.185812
               b   -0.882751
       two     a    1.317084
               b    0.863988
dtype: float64

In [105]:
# unstacked brings back the two columns
# by default unstacks the last level
unstacked = stacked.unstack()
unstacked

                     a         b
first second
bar   one     2.238318 -2.343009
      two    -0.341262  0.096108
baz   one    -0.298054 -0.363310
      two    -0.037365  0.712647
foo   one    -1.764934  0.332688
      two    -0.789687 -0.191329
qux   one    -1.185812 -0.882751
      two     1.317084  0.863988

In [106]:
stacked.unstack(1)

second        one       two
first
bar   a  2.238318 -0.341262
      b -2.343009  0.096108
baz   a -0.298054 -0.037365
      b -0.363310  0.712647
foo   a -1.764934 -0.789687
      b  0.332688 -0.191329
qux   a -1.185812  1.317084
      b -0.882751  0.863988

In [107]:
stacked.unstack(0)

first          bar       baz       foo       qux
second
one    a  2.238318 -0.298054 -1.764934 -1.185812
       b -2.343009 -0.363310  0.332688 -0.882751
two    a -0.341262 -0.037365 -0.789687  1.317084
       b  0.096108  0.712647 -0.191329  0.863988

In [108]:
# you can basically pivot the columns and rows using a combination of stack() and unstack()
unstacked.unstack()

               a                   b
second       one       two       one       two
first
bar     2.238318 -0.341262 -2.343009  0.096108
baz    -0.298054 -0.037365 -0.363310  0.712647
foo    -1.764934 -0.789687  0.332688 -0.191329
qux    -1.185812  1.317084 -0.882751  0.863988

## Pivot Tables

In [109]:
# we're now just using data created in the pandas documentation - just cause, time.
pivot_tables_df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
pivot_tables_df

        A  B    C         D         E
0     one  A  foo  1.316559 -0.243543
1     one  B  foo -0.742366  0.121284
2     two  C  foo -0.390119  0.133490
3   three  A  bar -0.024618 -1.644290
4     one  B  bar  0.964386  0.581754
5     one  C  bar -0.252663 -0.031184
6     two  A  foo -1.224694 -0.060425
7   three  B  foo -0.122378  0.286649
8     one  C  foo  1.091888  0.325684
9     one  A  bar -0.145460 -0.729447
10    two  B  bar  0.622579 -0.129228
11  three  C  bar  1.149440  0.631634

In [110]:
# simple pivot tables - data, values to aggregate, index, columns to pivot along
pd.pivot_table(pivot_tables_df, values = 'D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A -0.145460  1.316559
      B  0.964386 -0.742366
      C -0.252663  1.091888
three A -0.024618       NaN
      B       NaN -0.122378
      C  1.149440       NaN
two   A       NaN -1.224694
      B  0.622579       NaN
      C       NaN -0.390119

In [111]:
# more'n one columns of values
# mark all NaN as zero (0)
pd.pivot_table(pivot_tables_df, values = ['D', 'E'], index = ['A', 'B'], columns = ['C']).fillna(0)

                D                   E
C             bar       foo       bar       foo
A     B
one   A -0.145460  1.316559 -0.729447 -0.243543
      B  0.964386 -0.742366  0.581754  0.121284
      C -0.252663  1.091888 -0.031184  0.325684
three A -0.024618  0.000000 -1.644290  0.000000
      B  0.000000 -0.122378  0.000000  0.286649
      C  1.149440  0.000000  0.631634  0.000000
two   A  0.000000 -1.224694  0.000000 -0.060425
      B  0.622579  0.000000 -0.129228  0.000000
      C  0.000000 -0.390119  0.000000  0.133490

# Time Series

We may need to resample data to a different time-frequency. 

Like get data every second and resample to data every 5 minutes and so on...

In [114]:
rng = pd.date_range('01/01/2022', periods = 1000, freq = 'S')

In [119]:
ts = pd.Series(np.random.randint(0,500, len(rng)), index=rng)

In [120]:
ts.resample('5min').sum()

2022-01-01 00:00:00    75203
2022-01-01 00:05:00    72525
2022-01-01 00:10:00    73288
2022-01-01 00:15:00    24175
Freq: 5T, dtype: int32

read up on [date offset strings](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#dateoffset-objects) like '5min' etc.